RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sysclk_v2.c
cy_en_clkpump_divide_t Cy_SysClk_ClkPumpGetDivider(void)
{
    return ((cy_en_clkpump_divide_t)((uint32_t)_FLD2VAL(SRSS_CLK_SELECT_PUMP_DIV, SRSS_CLK_SELECT)));
}

bool Cy_SysClk_ClkPumpIsEnabled(void)
{
    return (_FLD2BOOL(SRSS_CLK_SELECT_PUMP_ENABLE, SRSS_CLK_SELECT));
}

void Cy_SysClk_ClkPumpEnable(void)
{
    SRSS_CLK_SELECT |= SRSS_CLK_SELECT_PUMP_ENABLE_Msk;
}


void Cy_SysClk_ClkPumpDisable(void)
{
    SRSS_CLK_SELECT &= ~SRSS_CLK_SELECT_PUMP_ENABLE_Msk;
}

uint32_t Cy_SysClk_ClkPumpGetFrequency(void)
{
    /* Divide the input frequency down and return the result */
    return (Cy_SysClk_ClkPumpIsEnabled() ?
            (Cy_SysClk_ClkPathGetFrequency((uint32_t)Cy_SysClk_ClkPumpGetSource()) /
             (1UL << (uint32_t)Cy_SysClk_ClkPumpGetDivider())) : 0UL);
}
#endif /* defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) */
/* ========================================================================== */
/* ==========================    clk_bak SECTION    ========================= */
/* ========================================================================== */

void Cy_SysClk_ClkBakSetSource(cy_en_clkbak_in_sources_t source)
{
    CY_ASSERT_L3(source <= CY_SYSCLK_BAK_IN_PILO);

#if defined (CY_IP_MXS22SRSS)
    BACKUP_CTL = (_CLR_SET_FLD32U(BACKUP_CTL, SRSS_CLK_WCO_CONFIG_CLK_RTC_SEL, (uint32_t) source));
#else
    BACKUP_CTL = (_CLR_SET_FLD32U(BACKUP_CTL, BACKUP_CTL_CLK_SEL, (uint32_t) source));
#endif
}


cy_en_clkbak_in_sources_t Cy_SysClk_ClkBakGetSource(void)
{
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'Intentional typecast to cy_en_clkbak_in_sources_t enum.');
#if defined (CY_IP_MXS22SRSS)
    return ((cy_en_clkbak_in_sources_t)_FLD2VAL(SRSS_CLK_WCO_CONFIG_CLK_RTC_SEL, BACKUP_CTL));
#else
    return ((cy_en_clkbak_in_sources_t)_FLD2VAL(BACKUP_CTL_CLK_SEL, BACKUP_CTL));
#endif
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');
}

/* ========================================================================== */
/* ===========================    clkLf SECTION    ========================== */
/* ========================================================================== */

void Cy_SysClk_ClkLfSetSource(cy_en_clklf_in_sources_t source)
{
    CY_ASSERT_L3(source <= CY_SYSCLK_CLKLF_IN_MAX);
    CY_REG32_CLR_SET(SRSS_CLK_SELECT, SRSS_CLK_SELECT_LFCLK_SEL, source);
}


cy_en_clklf_in_sources_t Cy_SysClk_ClkLfGetSource(void)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_clklf_in_sources_t enum.');
    return ((cy_en_clklf_in_sources_t)(_FLD2VAL(SRSS_CLK_SELECT_LFCLK_SEL, SRSS_CLK_SELECT)));
}

/* ========================================================================== */
/* ========================    clk_peri SECTION    ========================== */
/* ========================================================================== */

#if defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)

uint32_t Cy_SysClk_ClkPeriGetFrequency(void)
{
    uint32_t locFreq = Cy_SysClk_ClkHfGetFrequency(0UL); /* Get root frequency */
    uint32_t locDiv = 1UL + (uint32_t)Cy_SysClk_ClkPeriGetDivider(); /* peri prescaler (1-256) */

    /* Divide the path input frequency down and return the result */
    return (CY_SYSLIB_DIV_ROUND(locFreq, locDiv));
}

void Cy_SysClk_ClkPeriSetDivider(uint8_t divider)
{
    CY_REG32_CLR_SET(CPUSS_PERI_CLOCK_CTL, CPUSS_PERI_CLOCK_CTL_INT_DIV, divider);
}

uint8_t Cy_SysClk_ClkPeriGetDivider(void)
{
    return ((uint8_t)_FLD2VAL(CPUSS_PERI_CLOCK_CTL_INT_DIV, CPUSS_PERI_CLOCK_CTL));
}

#endif /* defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) */

/* ========================================================================== */
/* ========================    PERI SECTION    ========================== */
/* ========================================================================== */
cy_en_sysclk_status_t Cy_SysClk_PeriGroupSetDivider(uint32_t groupNum, uint32_t divider)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk )>>PERI_GR_INST_NUM_Pos);

    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);

    if (groupNum < ((uint32_t)CY_PERI_GROUP_NR))
    {
        if (divider <= (PERI_GR_CLOCK_CTL_INT8_DIV_Msk >> PERI_GR_CLOCK_CTL_INT8_DIV_Pos))
        {
            CY_REG32_CLR_SET(PERI_GR_CLOCK_CTL(instNum, groupNum), PERI_GR_CLOCK_CTL_INT8_DIV, divider);
            retVal = CY_SYSCLK_SUCCESS;
        }
    }

    return retVal;
}


uint32_t Cy_SysClk_PeriGroupGetDivider(uint32_t groupNum)
{
    uint32_t retVal = 0UL;
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk )>>PERI_GR_INST_NUM_Pos);

    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);

    if (groupNum < ((uint32_t)CY_PERI_GROUP_NR))
    {
        return(_FLD2VAL(PERI_GR_CLOCK_CTL_INT8_DIV, PERI_GR_CLOCK_CTL(instNum, groupNum)));

    }

    return retVal;
}

cy_en_sysclk_status_t Cy_SysClk_PeriGroupSetSlaveCtl(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl, uint32_t value)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk )>>PERI_GR_INST_NUM_Pos);

    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L3(groupNum < CY_PERI_GROUP_NR);
    CY_ASSERT_L2(CY_SYSCLK_IS_SL_CTL_NUM_VALID(slaveCtl));

    switch(slaveCtl)
    {
        case CY_SYSCLK_PERI_GROUP_SL_CTL:
            PERI_GR_SL_CTL(instNum, groupNum) = value;
            retVal = CY_SYSCLK_SUCCESS;
            break;
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS)  || defined (CY_IP_MXS22SRSS)
        case CY_SYSCLK_PERI_GROUP_SL_CTL2:
            PERI_GR_SL_CTL2(instNum, groupNum) = value;
            retVal = CY_SYSCLK_SUCCESS;
            break;
        case CY_SYSCLK_PERI_GROUP_SL_CTL3:
            /* Writes not allowed on SL_CTL3 */
            retVal = CY_SYSCLK_BAD_PARAM;
            break;
#endif
        default:
            retVal = CY_SYSCLK_BAD_PARAM;
            break;
    }

    return retVal;
}


uint32_t Cy_SysClk_PeriGroupGetSlaveCtl(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl)
{
    uint32_t retVal = 0;
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk )>>PERI_GR_INST_NUM_Pos);

    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L3(groupNum < CY_PERI_GROUP_NR);
    CY_ASSERT_L2(CY_SYSCLK_IS_SL_CTL_NUM_VALID(slaveCtl));

    switch(slaveCtl)
    {
        case CY_SYSCLK_PERI_GROUP_SL_CTL:
            retVal = PERI_GR_SL_CTL(instNum, groupNum);
            break;
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS)
        case CY_SYSCLK_PERI_GROUP_SL_CTL2:
            retVal = PERI_GR_SL_CTL2(instNum, groupNum);
            break;
        case CY_SYSCLK_PERI_GROUP_SL_CTL3:
            retVal = PERI_GR_SL_CTL3(instNum, groupNum);
            break;
#endif
        default:
            retVal = (uint32_t)CY_SYSCLK_BAD_PARAM;
            break;
    }

    return retVal;
}

bool Cy_SysClk_IsPeriGroupSlaveCtlSet(uint32_t groupNum,cy_en_peri_grp_sl_ctl_num_t slaveCtl, uint32_t slaveMsk)
{
    bool retVal = false;
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk )>>PERI_GR_INST_NUM_Pos);

    CY_ASSERT_L3(groupNum < CY_PERI_GROUP_NR);
    CY_ASSERT_L2(CY_SYSCLK_IS_SL_CTL_NUM_VALID(slaveCtl));

    switch(slaveCtl)
    {
        case CY_SYSCLK_PERI_GROUP_SL_CTL:
            if ((PERI_GR_SL_CTL(instNum, groupNum) & slaveMsk) != 0UL)
            {
                retVal = true;
            }
            break;
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS)
        case CY_SYSCLK_PERI_GROUP_SL_CTL2:
            if ((PERI_GR_SL_CTL2(instNum, groupNum) & slaveMsk) != 0UL)
            {
                retVal = true;
            }
            break;
        case CY_SYSCLK_PERI_GROUP_SL_CTL3:
            if ((PERI_GR_SL_CTL3(instNum, groupNum) & slaveMsk) != 0UL)
            {
                retVal = true;
            }
            break;
#endif
        default:
            CY_ASSERT_L2(false);
            break;
    }

    return retVal;
}

/* ========================================================================== */
/* =========================    clk_fast SECTION    ========================= */
/* ========================================================================== */

