RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sysclk_v2.c
bool Cy_SysClk_IsClkHfDirectSelEnabled(uint32_t clkHf)
{
    bool retVal = false;
    if (clkHf < CY_SRSS_NUM_HFROOT)
    {
        return !(_FLD2BOOL(SRSS_CLK_ROOT_SELECT_DIRECT_MUX, SRSS_CLK_ROOT_SELECT[clkHf]));
    }
    return (retVal);
}

#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) */

/* ========================================================================== */
/* ============================    MFO SECTION    ============================ */
/* ========================================================================== */


void Cy_SysClk_MfoEnable(bool deepSleepEnable)
{
#if (defined(CY_SRSS_MFO_PRESENT) && (CY_SRSS_MFO_PRESENT))
#if defined (CY_IP_MXS28SRSS)
    SRSS_CLK_MFO_CONFIG = SRSS_CLK_MFO_CONFIG_ENABLE_Msk;
#else
    SRSS_CLK_MFO_CONFIG = SRSS_CLK_MFO_CONFIG_ENABLE_Msk | (deepSleepEnable ? SRSS_CLK_MFO_CONFIG_DPSLP_ENABLE_Msk : 0UL);
#endif
#endif
    (void) deepSleepEnable;
}

bool Cy_SysClk_MfoIsEnabled(void)
{
#if (defined(CY_SRSS_MFO_PRESENT) && (CY_SRSS_MFO_PRESENT))
    return (0UL != (SRSS_CLK_MFO_CONFIG & SRSS_CLK_MFO_CONFIG_ENABLE_Msk));
#else
    return false;
#endif

}

void Cy_SysClk_MfoDisable(void)
{
#if (defined(CY_SRSS_MFO_PRESENT) && (CY_SRSS_MFO_PRESENT))
    SRSS_CLK_MFO_CONFIG = 0UL;
#endif
}


/* ========================================================================== */
/* ============================    CLK_MF SECTION    ============================ */
/* ========================================================================== */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS28SRSS) || defined(CY_IP_MXS22SRSS)

void Cy_SysClk_ClkMfEnable(void)
{
    SRSS_CLK_MF_SELECT |= SRSS_CLK_MF_SELECT_ENABLE_Msk;
}


bool Cy_SysClk_ClkMfIsEnabled(void)
{
    return ((0UL != (SRSS_CLK_MF_SELECT & SRSS_CLK_MF_SELECT_ENABLE_Msk)));
}


void Cy_SysClk_ClkMfDisable(void)
{
    SRSS_CLK_MF_SELECT &= ~SRSS_CLK_MF_SELECT_ENABLE_Msk;
}


void Cy_SysClk_ClkMfSetDivider(uint32_t divider)
{
    if (CY_SYSCLK_IS_MF_DIVIDER_VALID(divider))
    {
        if (!Cy_SysClk_ClkMfIsEnabled())
        {
            CY_REG32_CLR_SET(SRSS_CLK_MF_SELECT, SRSS_CLK_MF_SELECT_MFCLK_DIV, divider - 1UL);
        }
    }
}


uint32_t Cy_SysClk_ClkMfGetDivider(void)
{
    return ((1UL + _FLD2VAL(SRSS_CLK_MF_SELECT_MFCLK_DIV, SRSS_CLK_MF_SELECT)));
}


uint32_t Cy_SysClk_ClkMfGetFrequency(void)
{
    uint32_t locFreq = (Cy_SysClk_MfoIsEnabled()) ? CY_SYSCLK_MFO_FREQ : 0UL; /* Get root frequency */
    uint32_t locDiv = Cy_SysClk_ClkMfGetDivider(); /* clkMf prescaler (1-256) */

    /* Divide the path input frequency down and return the result */
    return (CY_SYSLIB_DIV_ROUND(locFreq, locDiv));
}

void Cy_SysClk_ClkMfSetSource(cy_en_clkmf_in_sources_t source)
{
    CY_ASSERT_L3(CY_SYSCLK_IF_MF_SOURCE_VALID(source));
    CY_REG32_CLR_SET(SRSS_CLK_MF_SELECT, SRSS_CLK_MF_SELECT_MFCLK_SEL, source);
}


cy_en_clkmf_in_sources_t Cy_SysClk_ClkMfGetSource(void)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_clkmf_in_sources_t enum.');
    return ((cy_en_clkmf_in_sources_t)(_FLD2VAL(SRSS_CLK_MF_SELECT_MFCLK_SEL, SRSS_CLK_MF_SELECT)));
}

#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS28SRSS) */

/* ========================================================================== */
/* ===========================    WCO SECTION    =========================== */
/* ========================================================================== */

cy_en_sysclk_status_t Cy_SysClk_WcoEnable(uint32_t timeoutus)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_TIMEOUT;

    /* Enable WCO */
#if defined (CY_IP_MXS28SRSS)
    BACKUP_WCO_CTL |= BACKUP_WCO_CTL_WCO_EN_Msk;
#elif defined (CY_IP_MXS22SRSS)
    BACKUP_CTL |= SRSS_CLK_WCO_CONFIG_WCO_EN_Msk;
#else
    BACKUP_CTL |= BACKUP_CTL_WCO_EN_Msk;
#endif

    /* now do the timeout wait for STATUS, bit WCO_OK */
    for (; (Cy_SysClk_WcoOkay() == false) && (0UL != timeoutus); timeoutus--)
    {
        Cy_SysLib_DelayUs(1U);
    }

    if (0UL != timeoutus)
    {
        retVal = CY_SYSCLK_SUCCESS;
    }

    return (retVal);
}

bool Cy_SysClk_WcoOkay(void)
{
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
    return (_FLD2BOOL(BACKUP_STATUS_WCO_OK, BACKUP_STATUS));
#elif defined (CY_IP_MXS22SRSS)
    return (_FLD2BOOL(SRSS_CLK_WCO_STATUS_WCO_OK, BACKUP_STATUS));
#else
    return (_FLD2BOOL(BACKUP_WCO_STATUS_WCO_OK, BACKUP_STATUS));
#endif
}

void Cy_SysClk_WcoDisable(void)
{
#if defined (CY_IP_MXS28SRSS)
    BACKUP_WCO_CTL &= (uint32_t)~BACKUP_WCO_CTL_WCO_EN_Msk;
#elif defined (CY_IP_MXS22SRSS)
    BACKUP_CTL &= (uint32_t)~SRSS_CLK_WCO_CONFIG_WCO_EN_Msk;
#else
    BACKUP_CTL &= (uint32_t)~BACKUP_CTL_WCO_EN_Msk;
#endif
}

#if defined (CY_IP_MXS28SRSS)
void Cy_SysClk_WcoGainControl(cy_en_wco_gain_ctrl_modes_t gmMode)
{
    CY_REG32_CLR_SET(BACKUP_WCO_CTL, BACKUP_WCO_CTL_GM, gmMode);
}
#endif /* defined (CY_IP_MXS28SRSS) */

void Cy_SysClk_WcoBypass(cy_en_wco_bypass_modes_t bypass)
{
#if defined (CY_IP_MXS28SRSS)
    CY_REG32_CLR_SET(BACKUP_WCO_CTL, BACKUP_WCO_CTL_WCO_BYP_EN, bypass);
#elif defined (CY_IP_MXS22SRSS)
    CY_REG32_CLR_SET(BACKUP_CTL, SRSS_CLK_WCO_CONFIG_WCO_BYPASS, bypass);
#else
    CY_REG32_CLR_SET(BACKUP_CTL, BACKUP_CTL_WCO_BYPASS, bypass);
#endif
}

/* ========================================================================== */
/* ===========================    PILO SECTION    =========================== */
/* ========================================================================== */

void Cy_SysClk_PiloEnable(void)
{
#if (defined (CY_SRSS_PILO_PRESENT) && (CY_SRSS_PILO_PRESENT))
    SRSS_CLK_PILO_CONFIG |= SRSS_CLK_PILO_CONFIG_PILO_EN_Msk; /* 1 = enable */
#endif
}
#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
void Cy_SysClk_PiloBackupEnable(void)
{
#if (defined (CY_SRSS_PILO_PRESENT) && (0U != CY_SRSS_PILO_PRESENT) && (!defined (CY_IP_MXS22SRSS)))
    SRSS_CLK_PILO_CONFIG |= SRSS_CLK_PILO_CONFIG_PILO_BACKUP_Msk; /* 1 = enable */
#endif
}

