RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sysclk_v2.c
void Cy_SysClk_PiloBackupDisable(void)
{
#if (defined (CY_SRSS_PILO_PRESENT) && (CY_SRSS_PILO_PRESENT) && (!defined (CY_IP_MXS22SRSS)))
    /* Clear PILO_BACKUP bitfields. */
    SRSS_CLK_PILO_CONFIG &= (uint32_t)~(SRSS_CLK_PILO_CONFIG_PILO_BACKUP_Msk);
#endif
}
#endif

#if defined (CY_IP_MXS40SSRSS)
void Cy_SysClk_PiloTcscEnable(void)
{
#if (CY_SRSS_PILO_PRESENT)
    SRSS_CLK_PILO_CONFIG |= SRSS_CLK_PILO_CONFIG_PILO_TCSC_EN_Msk; /* 1 = enable */
#endif
}

void Cy_SysClk_PiloTcscDisable(void)
{
#if (CY_SRSS_PILO_PRESENT)
    /* Clear PILO_TCSC_EN( Second order temperature curvature correction.) bitfields. */
    SRSS_CLK_PILO_CONFIG &= (uint32_t)~(SRSS_CLK_PILO_CONFIG_PILO_TCSC_EN_Msk);
#endif
}

#endif /* defined (CY_IP_MXS40SSRSS) */

bool Cy_SysClk_PiloIsEnabled(void)
{
#if (defined (CY_SRSS_PILO_PRESENT) && (CY_SRSS_PILO_PRESENT))
    return (_FLD2BOOL(SRSS_CLK_PILO_CONFIG_PILO_EN, SRSS_CLK_PILO_CONFIG));
#else
    return false;
#endif
}

void Cy_SysClk_PiloDisable(void)
{
#if (defined (CY_SRSS_PILO_PRESENT) && (CY_SRSS_PILO_PRESENT))
    /* Clear PILO_EN */
    SRSS_CLK_PILO_CONFIG &= (uint32_t)~(SRSS_CLK_PILO_CONFIG_PILO_EN_Msk);
#endif
}

/* ========================================================================== */
/* ==========================    ALTHF SECTION    =========================== */
/* ========================================================================== */

uint32_t Cy_SysClk_AltHfGetFrequency(void)
{
    #if defined (CY_IP_MXS40BLE52SS)
        return Cy_BTSS_GetXtalOscFreq();
    #else
        return (0UL);
    #endif /* CY_IP_MXS40BLE52SS */
}

cy_en_sysclk_status_t Cy_SysClk_AltHfEnable(uint32_t timeoutus)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_TIMEOUT;

    CY_UNUSED_PARAMETER(timeoutus);
#if (CY_SRSS_ALTHF_PRESENT)
    /* Enable ALTHF */
    SRSS_CLK_ALTHF_CTL |= SRSS_CLK_ALTHF_CTL_ALTHF_ENABLE_Msk;

    /* now do the timeout for ALTHF to be enabled  */
    for (; (Cy_SysClk_IsAltHfEnabled() == false) && (0UL != timeoutus); timeoutus--)
    {
        Cy_SysLib_DelayUs(1U);
    }

    if (0UL != timeoutus)
    {
        retVal = CY_SYSCLK_SUCCESS;
    }
#endif

    return (retVal);
}

bool Cy_SysClk_IsAltHfEnabled(void)
{
#if (CY_SRSS_ALTHF_PRESENT)
    return (_FLD2BOOL(SRSS_CLK_ALTHF_CTL_ALTHF_ENABLED, SRSS_CLK_ALTHF_CTL));
#else
    return false;
#endif
}

/* ========================================================================== */
/* ==========================    ALTLF SECTION    =========================== */
/* ========================================================================== */


uint32_t Cy_SysClk_AltLfGetFrequency(void)
{
    return (0UL);
}


bool Cy_SysClk_AltLfIsEnabled(void)
{
    return (false);
}


/* ========================================================================== */
/* ===========================    ILO SECTION    ============================ */
/* ========================================================================== */

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))


/* Below ILO API's are valid for both ILO0 and ILO1 */
void Cy_SysClk_IloSrcEnable(uint32_t iloNum)
{
    CY_ASSERT_L1(iloNum < CY_SRSS_ILO_COUNT);

    if (0UL == iloNum)
    {
        SRSS_CLK_ILO0_CONFIG |= SRSS_CLK_ILO0_CONFIG_ENABLE_Msk;
    }
    else
    {
        SRSS_CLK_ILO1_CONFIG |= SRSS_CLK_ILO1_CONFIG_ENABLE_Msk;
    }
}

cy_en_sysclk_status_t Cy_SysClk_IloSrcDisable(uint32_t iloNum)
{
    CY_ASSERT_L1(iloNum < CY_SRSS_ILO_COUNT);
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;

    if (0UL == iloNum)
    {
        if (!_FLD2BOOL(WDT_CTL_ENABLED, SRSS_WDT_CTL)) /* if disabled */
        {
            SRSS_CLK_ILO0_CONFIG &= ~SRSS_CLK_ILO0_CONFIG_ENABLE_Msk;
            retVal = CY_SYSCLK_SUCCESS;
        }
    }
    else
    {
        SRSS_CLK_ILO1_CONFIG &= ~SRSS_CLK_ILO1_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_SUCCESS;
    }
    return (retVal);
}

bool Cy_SysClk_IloSrcIsEnabled(uint32_t iloNum)
{
    CY_ASSERT_L1(iloNum < CY_SRSS_ILO_COUNT);

    if (0UL == iloNum)
    {
        return (_FLD2BOOL(SRSS_CLK_ILO0_CONFIG_ENABLE, SRSS_CLK_ILO0_CONFIG));
    }
    else
    {
        return (_FLD2BOOL(SRSS_CLK_ILO1_CONFIG_ENABLE, SRSS_CLK_ILO1_CONFIG));
    }
}

void Cy_SysClk_IloSrcHibernateOn(uint32_t iloNum, bool on)
{
    if (0UL == iloNum)
    {
        CY_REG32_CLR_SET(SRSS_CLK_ILO0_CONFIG, SRSS_CLK_ILO0_CONFIG_ILO0_BACKUP, ((on) ? 1UL : 0UL));
    }
}

#else
void Cy_SysClk_IloEnable(void)
{
#if (CY_SRSS_ILO_PRESENT)
    SRSS_CLK_ILO_CONFIG |= SRSS_CLK_ILO_CONFIG_ENABLE_Msk;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_IloDisable(void)
{
#if (CY_SRSS_ILO_PRESENT)
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;
    if (!_FLD2BOOL(SRSS_WDT_CTL_WDT_EN, SRSS_WDT_CTL)) /* if disabled */
    {
        SRSS_CLK_ILO_CONFIG &= ~SRSS_CLK_ILO_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_SUCCESS;
    }
    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}

bool Cy_SysClk_IloIsEnabled(void)
{
#if (CY_SRSS_ILO_PRESENT)
    return (_FLD2BOOL(SRSS_CLK_ILO_CONFIG_ENABLE, SRSS_CLK_ILO_CONFIG));
#else
    return false;
#endif
}

void Cy_SysClk_IloHibernateOn(bool on)
{
    CY_UNUSED_PARAMETER(on);
#if (CY_SRSS_ILO_PRESENT)
    CY_REG32_CLR_SET(SRSS_CLK_ILO_CONFIG, SRSS_CLK_ILO_CONFIG_ILO_BACKUP, ((on) ? 1UL : 0UL));
#endif
}

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) */


/* ========================================================================== */
/* =========================    EXTCLK SECTION    =========================== */
/* ========================================================================== */


    static uint32_t cySysClkExtFreq = 0UL;


#define CY_SYSCLK_EXTCLK_MAX_FREQ (100000000UL) /* 100 MHz */


void Cy_SysClk_ExtClkSetFrequency(uint32_t freq)
{
    if (freq <= CY_SYSCLK_EXTCLK_MAX_FREQ)
    {
        cySysClkExtFreq = freq;
    }
}

/*******************************************************************************
* Function Name: Cy_SysClk_ExtClkGetFrequency
****************************************************************************//**
*
* Returns the frequency of the External Clock Source (EXTCLK) from the
* internal storage.
*
* \return The frequency of the External Clock Source.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ExtClkSetFrequency
*
*******************************************************************************/
uint32_t Cy_SysClk_ExtClkGetFrequency(void)
{
    return (cySysClkExtFreq);
}

/* ========================================================================== */
/* ===========================    ECO SECTION    ============================ */
/* ========================================================================== */

