RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sysclk_v2.c
#if (CY_SRSS_ECO_PRESENT)
static uint32_t ecoFreq = 0UL; /* Internal storage for ECO frequency user setting */
#endif

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) || defined (CY_IP_MXS22SRSS)

#define CY_SYSCLK_INVALID_TRIM_VALUE (0xFFFFFFFFUL)

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))

#define M_PI (3.1415927f)

/** \cond *********************************************************************
* Function Name: cy_sqrt
* Calculates square root.
* The input is 32-bit wide.
* The result is 16-bit wide.
*******************************************************************************/
static uint32_t cy_sqrt(uint32_t x);
static uint32_t cy_sqrt(uint32_t x)
{
    uint32_t i;
    uint32_t res = 0UL;
    uint32_t add = 0x8000UL;

    for(i = 0UL; i < 16UL; i++)
    {
        uint32_t tmp = res | add;

        if (x >= (tmp * tmp))
        {
            res = tmp;
        }

        add >>= 1U;
    }

    return (res);
}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoAtrim
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for ATRIM bits in register CLK_ECO_CONFIG2.
*   max amplitude (Vp) |   ATRIM value
*      0.50[V] <= Vp < 0.55[V]    |      0x04
*      0.55[V] <= Vp < 0.55[V]    |      0x05
*      0.60[V] <= Vp < 0.65[V]    |      0x06
*      0.65[V] <= Vp < 0.65[V]    |      0x07
*      0.70[V] <= Vp < 0.75[V]    |      0x08
*      0.75[V] <= Vp < 0.75[V]    |      0x09
*      0.80[V] <= Vp < 0.85[V]    |      0x0A
*      0.85[V] <= Vp < 0.75[V]    |      0x0B
*      0.90[V] <= Vp < 0.95[V]    |      0x0C
*      0.95[V] <= Vp < 1.00[V]    |      0x0D
*      1.00[V] <= Vp < 1.05[V]    |      0x0E
*      1.05[V] <= Vp < 1.10[V]    |      0x0F
*      1.10[V] <= Vp              |      0x00
*
*   \param maxAmplitude: Max amplitude (Vp) calculated by below formula.
*         Vpp = 1,000 * sqrt(drivelevel / 2 / esr) / 3.14 / freqMHz / cLoad
*
*   \return : value to be set to ATRIM.
*             It returns 0xFFFFFFFF, when there are no proper value.
*
*******************************************************************************/

__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoAtrim(float32_t maxAmplitude)
{
    if(maxAmplitude < 0.50f)
    {
        return (CY_SYSCLK_INVALID_TRIM_VALUE);
    }

    if((0.50f <= maxAmplitude) && (maxAmplitude < 0.55f))
    {
        return(0x04UL);
    }
    else if(maxAmplitude < 0.60f)
    {
        return(0x05UL);
    }
    else if(maxAmplitude < 0.65f)
    {
        return(0x06UL);
    }
    else if(maxAmplitude < 0.70f)
    {
        return(0x07UL);
    }
    else if(maxAmplitude < 0.75f)
    {
        return(0x08UL);
    }
    else if(maxAmplitude < 0.80f)
    {
        return(0x09UL);
    }
    else if(maxAmplitude < 0.85f)
    {
        return(0x0AUL);
    }
    else if(maxAmplitude < 0.90f)
    {
        return(0x0BUL);
    }
    else if(maxAmplitude < 0.95f)
    {
        return(0x0CUL);
    }
    else if(maxAmplitude < 1.00f)
    {
        return(0x0DUL);
    }
    else if(maxAmplitude < 1.05f)
    {
        return(0x0EUL);
    }
    else if(maxAmplitude < 1.10f)
    {
        return(0x0FUL);
    }
    else if(1.1f <= maxAmplitude)
    {
        return(0x00UL);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }

}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoAGCEN
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for AGC_EN bits in register CLK_ECO_CONFIG.
*   max amplitude (Vp) |   ATRIM value
*      0.50[V] <= Vp < 1.10[V]    |      0x00
*      1.10[V] <= Vp              |      0x01
*
*   \param maxAmplitude: Max amplitude (Vp) calculated by below formula.
*         Vpp = 1,000 * sqrt(drivelevel / 2 / esr) / 3.14 / freqMHz / cLoad
*
*   \return : value to be set to AGC_EN.
*             It returns 0xFFFFFFFF, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoAGCEN(float32_t maxAmplitude)
{
    if((0.50f <= maxAmplitude) && (maxAmplitude < 1.10f))
    {
        return(0x01UL);
    }
    else if(1.10f <= maxAmplitude)
    {
        return(0x00UL);
    }
    else
    {
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoWDtrim
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for WDTRIM bits in register CLK_ECO_CONFIG2.
*   max amplitude (Vp) |   WDTRIM value
*      0.5[V] <= Vp <  0.6[V]    |      0x02
*      0.6[V] <= Vp <  0.7[V]    |      0x03
*      0.7[V] <= Vp <  0.8[V]    |      0x04
*      0.8[V] <= Vp <  0.9[V]    |      0x05
*      0.9[V] <= Vp <  1.0[V]    |      0x06
*      1.0[V] <= Vp <  1.1[V]    |      0x07
*      1.1[V] <= Vp              |      0x07
*
*   \param amplitude: Max amplitude (Vp) calculated by below formula.
*         Vp = 1,000 * sqrt(drivelevel / 2 / esr) / 3.14 / freqMHz / cLoad
*
*   \return : value to be set to WDTRIM.
*             It returns CY_SYSCLK_INVALID_TRIM_VALUE, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoWDtrim(float32_t amplitude)
{
    if(amplitude < 0.50f)
    {
        return (CY_SYSCLK_INVALID_TRIM_VALUE);
    }

    if( (0.50f <= amplitude) && (amplitude < 0.60f))
    {
        return(0x02UL);
    }
    else if(amplitude < 0.7f)
    {
        return(0x03UL);
    }
    else if(amplitude < 0.8f)
    {
        return(0x04UL);
    }
    else if(amplitude < 0.9f)
    {
        return(0x05UL);
    }
    else if(amplitude < 1.0f)
    {
        return(0x06UL);
    }
    else if(amplitude < 1.1f)
    {
        return(0x07UL);
    }
    else if(1.1f <= amplitude)
    {
        return(0x07UL);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

