RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sysclk_v2.c
/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoGtrim
****************************************************************************//**
*
*   The range of gm value will be defined by GTRIM value as shown in below table.
*   We set the GTRIM value so that it is guaranteed for gm value to be more than gm_min
*
*    GTRIM value |  gm
*       0x00     |  0.0[mA/V] <= gm < 2.2[mA/V]
*       0x01     |  2.2[mA/V] <= gm < 4.4[mA/V]
*       0x02     |  4.4[mA/V] <= gm < 6.6[mA/V]
*       0x03     |  6.6[mA/V] <= gm < 8.8[mA/V]
*       0x04     |  8.8[mA/V] <= gm <11.0[mA/V]
*       0x05     | 11.0[mA/V] <= gm <13.2[mA/V]
*       0x06     | 13.2[mA/V] <= gm <15.4[mA/V]
*       0x07     | 15.4[mA/V] <= gm <17.6[mA/V]
*
*   \param gm_min: Minimum of gm (gm_min) calculated by below formula.
*   gm_min mA/V = 5 * 4 * 3.14 * 3.14 * freqMhz^2 * cLoad^2 * 4 * esr / 1,000,000,000
*
*   \return : value to be set to GTRIM.
*             It returns CY_SYSCLK_INVALID_TRIM_VALUE, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoGtrim(float32_t gm_min)
{
    if( (0.0f <= gm_min) && (gm_min < 2.2f))
    {
        return(0x00UL+1UL);
    }
    else if(gm_min < 4.4f)
    {
        return(0x01UL+1UL);
    }
    else if(gm_min < 6.6f)
    {
        return(0x02UL+1UL);
    }
    else if(gm_min < 8.8f)
    {
        return(0x03UL+1UL);
    }
    else if(gm_min < 11.0f)
    {
        return(0x04UL+1UL);
    }
    else if(gm_min < 13.2f)
    {
        return(0x05UL+1UL);
    }
    else if(gm_min < 15.4f)
    {
        return(0x06UL+1UL);
    }
    else if(gm_min < 17.6f)
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoRtrim
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for RTRIM bits in register CLK_ECO_CONFIG2.
*         Eco freq  (F)            |   RTRIM value
*                  F > 28.60[MHz]  |      0x00
*    28.60[MHz] >= F > 23.33[MHz]  |      0x01
*    23.33[MHz] >= F > 16.50[MHz]  |      0x02
*    16.50[MHz] >= F               |      0x03
*
*   \param freqMHz: Operating frequency of the crystal in MHz.
*
*   \return : value to be set to RTRIM.
*             It returns CY_SYSCLK_INVALID_TRIM_VALUE, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoRtrim(float32_t freqMHz)
{
    if(freqMHz > 28.6f)
    {
        return(0x00UL);
    }
    else if(freqMHz > 23.33f)
    {
        return(0x01UL);
    }
    else if(freqMHz > 16.5f)
    {
        return(0x02UL);
    }
    else if(freqMHz > 0.0f)
    {
        return(0x03UL);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoFtrim
****************************************************************************//**
*
*   In accordance with the table below, this function Outputs proper
*   value for FTRIM bits in register CLK_ECO_CONFIG2.
*
*   \return : value to be set to FTRIM.
*
*   \note: This function does not check the invalid input value.
*          It should be cared by caller program.
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoFtrim(void)
{
    return(0x03UL);
}

cy_en_sysclk_status_t Cy_SysClk_EcoConfigure(uint32_t freq, uint32_t cSum, uint32_t esr, uint32_t driveLevel)
{
    uint32_t minRneg = (5UL * esr);

    /* Invalid state error if ECO is already enabled */
    if (0UL != (SRSS_CLK_ECO_CONFIG_ECO_EN_Msk & SRSS_CLK_ECO_CONFIG))
    {
        return(CY_SYSCLK_INVALID_STATE);
    }

    /* calculate intermediate values */
    float32_t freqMHz = (float32_t)freq / 1000000.0f;

    uint32_t maxAmpl = CY_SYSLIB_DIV_ROUND((159155UL * /* 5 * 100000 / PI */
           cy_sqrt(CY_SYSLIB_DIV_ROUND(2000000UL * driveLevel, esr))), /* Scaled by 2 */
                                       (CY_SYSLIB_DIV_ROUND(freq, 1000UL)/* KHz */ * cSum)); /* The result is scaled by 10^3 */

    float32_t maxAmplitude = (float32_t)maxAmpl/1000.0f;

    float32_t gm_min = (157.91367042f /*4 * M_PI * M_PI * 4*/ * (float32_t)minRneg * freqMHz * freqMHz * (float32_t)cSum * (float32_t)cSum) /
                             1000000000.0f;

    /* Get trim values according to calculated values */
    uint32_t atrim, agcen, wdtrim, gtrim, rtrim, ftrim;

    atrim  = Cy_SysClk_SelectEcoAtrim(maxAmplitude);
    if(atrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    agcen = Cy_SysClk_SelectEcoAGCEN(maxAmplitude);
    if(agcen == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    wdtrim = Cy_SysClk_SelectEcoWDtrim(maxAmplitude);
    if(wdtrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    gtrim  = Cy_SysClk_SelectEcoGtrim(gm_min);
    if(gtrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    rtrim  = Cy_SysClk_SelectEcoRtrim(freqMHz);
    if(rtrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

    ftrim  = Cy_SysClk_SelectEcoFtrim();

    /* Update all fields of trim control register with one write, without changing the ITRIM field */
    SRSS_CLK_ECO_CONFIG2 =
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_WDTRIM, wdtrim)  |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_ATRIM, atrim) |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_FTRIM, ftrim)    |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_RTRIM, rtrim)    |
        _VAL2FLD(SRSS_CLK_ECO_CONFIG2_GTRIM, gtrim);

