RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sysclk_v2.c
    SRSS_CLK_ECO_CONFIG = _VAL2FLD(SRSS_CLK_ECO_CONFIG_AGC_EN, agcen);

    ecoFreq = freq;

    return(CY_SYSCLK_SUCCESS);
}

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) */

#if defined (CY_IP_MXS22SRSS)

#define CY_SYSCLK_CTRIM_TABLE_MAX_ENTRIES 32U

/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoCtrim
****************************************************************************//**
*
*    Get CTRIM value(CL- Crystal load cap configuration trim)
*
*    Calculations:
*    Target Cap = (2 * Load Capacitance) - (Board Trace Cap + Chip Pad Cap)
*    Pick CTRIM based on below table
*
*    CTRIM|  Condition
*    0x1  |  Target Cap <= 2.73(pF)
*    0x2  |  Target Cap <= 4.73(pF)
*    0x3  |  Target Cap <= 6.57(pF)
*    0x4  |  Target Cap <= 8.75(pF)
*    0x5  |  Target Cap <= 10.6(pF)
*    0x6  |  Target Cap <= 12.6(pF)
*    0x7  |  Target Cap <= 14.4(pF)
*    0x8  |  Target Cap <= 16.8(pF)
*    0x9  |  Target Cap <= 18.6(pF)
*    0xa  |  Target Cap <= 20.6(pF)
*    0xb  |  Target Cap <= 22.5(pF)
*    0xc  |  Target Cap <= 24.6(pF)
*    0xd  |  Target Cap <= 26.5(pF)
*    0xe  |  Target Cap <= 28.5(pF)
*    0xf  |  Target Cap <= 30.3(pF)
*    0x10 |  Target Cap <= 10.8(pF)
*    0x11 |  Target Cap <= 12.6(pF)
*    0x12 |  Target Cap <= 14.6(pF)
*    0x13 |  Target Cap <= 16.4(pF)
*    0x14 |  Target Cap <= 18.6(pF)
*    0x15 |  Target Cap <= 20.5(pF)
*    0x16 |  Target Cap <= 22.5(pF)
*    0x17 |  Target Cap <= 24.3(pF)
*    0x18 |  Target Cap <= 26.6(pF)
*    0x19 |  Target Cap <= 28.5(pF)
*    0x1a |  Target Cap <= 30.5(pF)
*    0x1b |  Target Cap <= 32.3(pF)
*    0x1c |  Target Cap <= 34.5(pF)
*    0x1d |  Target Cap <= 36.3(pF)
*    0x1e |  Target Cap <= 38.3(pF)
*    0x1f |  Target Cap <= 40.2(pF)
*    0x20 |  Target Cap <= 500(pF)
*
*   \param loadCap: Load Capacitance (In pF * 100)
*   \param boardTraceCap: Board Trace Capacitance (In pF * 100)
*   \param chipPadCap: Chip Pad Capacitance (In pF * 100)
*
*   \return : value to be set to CTRIM.
*             It returns CY_SYSCLK_INVALID_TRIM_VALUE, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoCtrim(uint32_t loadCap, uint32_t boardTraceCap, uint32_t chipPadCap)
{
    uint32_t targetCap, idx;
    uint32_t cTrimValue = CY_SYSCLK_INVALID_TRIM_VALUE;
    uint32_t simCapTable[] = {   /* Simulated Capacitance are multiplied by 100 to take care of decimal values */
        273,
        473,
        657,
        875,
        106,
        126,
        144,
        168,
        186,
        206,
        225,
        246,
        265,
        285,
        303,
        108,
        126,
        146,
        164,
        186,
        205,
        225,
        243,
        266,
        285,
        305,
        323,
        345,
        363,
        383,
        402,
        5000
    };

    /* All Capacitance are multiplied by 100 to take care of the decimal values */
    targetCap = (2 * loadCap) - (boardTraceCap + chipPadCap);

    for(idx = 0; idx < CY_SYSCLK_CTRIM_TABLE_MAX_ENTRIES; idx++)
    {
        if(targetCap <= simCapTable[idx])
        {
           break;
        }
    }
    if(idx != CY_SYSCLK_CTRIM_TABLE_MAX_ENTRIES)
    {
        cTrimValue = idx + 1U;
    }

    return cTrimValue;
}


/*******************************************************************************
* Function Name: Cy_SysClk_SelectEcoGtrim
****************************************************************************//**
*
*   The range of gm value will be defined by GTRIM value as shown in below table.
*   We set the GTRIM value so that it is guaranteed for gm value to be more than gm_min
*
*    GTRIM value |  gm
*       0x00     |  0.0[mA/V] <= gm < 2.2[mA/V]
*       0x01     |  2.2[mA/V] <= gm < 4.4[mA/V]
*       0x02     |  4.4[mA/V] <= gm < 6.6[mA/V]
*       0x03     |  6.6[mA/V] <= gm < 8.8[mA/V]
*       0x04     |  8.8[mA/V] <= gm <11.0[mA/V]
*       0x05     | 11.0[mA/V] <= gm <13.2[mA/V]
*       0x06     | 13.2[mA/V] <= gm <15.4[mA/V]
*       0x07     | 15.4[mA/V] <= gm <17.6[mA/V]
*
*   \param gm_min: Minimum of gm (gm_min) calculated by below formula.
*   gm_min mA/V = 5 * 4 * 3.14 * 3.14 * freqMhz^2 * cLoad^2 * 4 * esr / 1,000,000,000
*
*   \return : value to be set to GTRIM.
*             It returns CY_SYSCLK_INVALID_TRIM_VALUE, when there are no proper value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_SelectEcoGtrim(float32_t gm_min)
{
    if( (0.0f <= gm_min) && (gm_min < 2.2f))
    {
        return(0x00UL+1UL);
    }
    else if(gm_min < 4.4f)
    {
        return(0x01UL+1UL);
    }
    else if(gm_min < 6.6f)
    {
        return(0x02UL+1UL);
    }
    else if(gm_min < 8.8f)
    {
        return(0x03UL+1UL);
    }
    else if(gm_min < 11.0f)
    {
        return(0x04UL+1UL);
    }
    else if(gm_min < 13.2f)
    {
        return(0x05UL+1UL);
    }
    else if(gm_min < 15.4f)
    {
        return(0x06UL+1UL);
    }
    else if(gm_min < 17.6f)
    {
        return(0x07UL+1UL);
    }
    else if(gm_min < 19.8f)
    {
        return(0x08UL+1UL);
    }
    else if(gm_min < 22.0f)
    {
        return(0x09UL+1UL);
    }
    else if(gm_min < 24.2f)
    {
        return(0xaUL+1UL);
    }
    else if(gm_min < 26.4f)
    {
        return(0xbUL+1UL);
    }
    else if(gm_min < 28.6f)
    {
        return(0xcUL+1UL);
    }
    else if(gm_min < 30.2f)
    {
        return(0x0dUL+1UL);
    }
    else if(gm_min < 32.4f)
    {
        return(0x0eUL+1UL);
    }
    else if(gm_min < 34.6f)
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
    else
    {
        // invalid input
        return(CY_SYSCLK_INVALID_TRIM_VALUE);
    }
}

cy_en_sysclk_status_t Cy_SysClk_EcoConfigure(uint32_t freq, uint32_t cSum, uint32_t esr, uint32_t driveLevel)
{
    uint32_t minRneg = (5UL * esr);

    CY_UNUSED_PARAMETER(driveLevel);

    /* Invalid state error if ECO is already enabled */
    if (0UL != (SRSS_CLK_ECO_CONFIG_ECO_EN_Msk & SRSS_CLK_ECO_CONFIG))
    {
        return(CY_SYSCLK_INVALID_STATE);
    }

    /* calculate intermediate values */
    float32_t freqMHz = (float32_t)freq / 1000000.0f;

    float32_t gm_min = (157.91367042f /*4 * M_PI * M_PI * 4*/ * (float32_t)minRneg * freqMHz * freqMHz * (float32_t)cSum * (float32_t)cSum) /
                             1000000000.0f;

    uint32_t gtrim, cTrim;

    gtrim  = Cy_SysClk_SelectEcoGtrim(gm_min);
    if(gtrim == CY_SYSCLK_INVALID_TRIM_VALUE)
    {
        return(CY_SYSCLK_BAD_PARAM);
    }

