RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sysclk_v2.c
            SRSS_CLK_OUTPUT_SLOW = ((SRSS_CLK_OUTPUT_SLOW & ((uint32_t) ~clkOutputSlowMask)) | clkOutputSlowVal);
            SRSS_CLK_OUTPUT_FAST = ((SRSS_CLK_OUTPUT_FAST & ((uint32_t) ~clkOutputFastMask)) | clkOutputFastVal);

            /* Save this input parameter for use later, in other functions.
               No error checking is done on this parameter */
            clk1Count1 = count1;

            /* Counting starts when counter1 is written with a nonzero value */
            SRSS_CLK_CAL_CNT1 = clk1Count1;

            retVal = CY_SYSCLK_SUCCESS;
        }
    }
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return (retVal);
}


uint32_t Cy_SysClk_ClkMeasurementCountersGetFreq(bool measuredClock, uint32_t refClkFreq)
{
    uint32_t retVal = 0UL;
    bool isMeasurementValid = false;

    /* Done counting; allow entry into Deep Sleep mode */
    clkCounting = false;

    /* Check whether the device was in the Deep Sleep mode or the flash partially blocked while the
    *  operation was done
    */
    if(SRSS_TST_DDFT_SLOW_CTL_REG == TST_DDFT_SLOW_CTL_DEFAULT_VAL)
    {
       if(SRSS_TST_DDFT_FAST_CTL_REG == TST_DDFT_FAST_CTL_DEFAULT_VAL)
       {
           isMeasurementValid = true;
       }
    }

    retVal = _FLD2VAL(SRSS_CLK_CAL_CNT2_CAL_COUNTER2, SRSS_CLK_CAL_CNT2);

    if (isMeasurementValid && (0UL != retVal))
    {
        if (!measuredClock)
        {   /* clock1 is the measured clock */
            retVal = (uint32_t)CY_SYSLIB_DIV_ROUND((uint64_t)clk1Count1 * (uint64_t)refClkFreq, (uint64_t)retVal);
        }
        else
        {   /* clock2 is the measured clock */
            retVal = (uint32_t)CY_SYSLIB_DIV_ROUND((uint64_t)retVal * (uint64_t)refClkFreq, (uint64_t)clk1Count1);
        }
    }
    else
    {
        /* Return zero value to indicate invalid measurement */
        retVal = 0UL;
    }
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return (retVal);
}


/* ========================================================================== */
/* ==========================    TRIM SECTION    ============================ */
/* ========================================================================== */

/** \cond INTERNAL */
/** \cond INTERNAL */
#define CY_SYSCLK_ILO_TARGET_FREQ  (32768UL)
/* Nominal trim step size is 1.5% of "the frequency". Using the target frequency */
#define CY_SYSCLK_ILO_TRIM_STEP    (CY_SYSLIB_DIV_ROUND(CY_SYSCLK_ILO_TARGET_FREQ * 15UL, 1000UL))
/** \endcond */

int32_t Cy_SysClk_PiloTrim(uint32_t piloFreq)
{
    CY_UNUSED_PARAMETER(piloFreq); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return 0;
}

void Cy_SysClk_PiloInitialTrim(void)
{
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */
}

void Cy_SysClk_PiloUpdateTrimStep(void)
{
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */
}

void Cy_SysClk_PiloSetTrim(uint32_t trimVal)
{
CY_UNUSED_PARAMETER(trimVal); /* Suppress a compiler warning about unused variables */
CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */
}

uint32_t Cy_SysClk_PiloGetTrim(void)
{
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return 0;
}

int32_t Cy_SysClk_IloTrim(uint32_t iloFreq)
{
#if defined (CY_IP_MXS40SSRSS)
    int32_t changeInTrim;
    uint32_t diff;
    bool sign = false;

    if(iloFreq > (CY_SYSCLK_ILO_TARGET_FREQ + CY_SYSCLK_ILO_TRIM_STEP))
    {
        diff = iloFreq - CY_SYSCLK_ILO_TARGET_FREQ;
    }
    else if (iloFreq < (CY_SYSCLK_ILO_TARGET_FREQ - CY_SYSCLK_ILO_TRIM_STEP))
    {
        diff = CY_SYSCLK_ILO_TARGET_FREQ - iloFreq;
        sign = true;
    }
    else
    {
        diff = 0UL;
    }

    /* Do nothing if iloFreq is already within one trim step from the target */
    if(0UL != diff)
    {
        /* Get current trim value */
        uint32_t trim = Cy_SysClk_IloGetTrim();

        diff = CY_SYSLIB_DIV_ROUND(diff, CY_SYSCLK_ILO_TRIM_STEP);

        if(sign)
        {
            trim += diff;
        }
        else
        {
            trim -= diff;
    }

    /* Update the trim value */
    Cy_SysClk_IloSetTrim(trim);
    }

    changeInTrim = (sign ? (int32_t)diff : (0L - (int32_t)diff));
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return changeInTrim;
#else
    CY_UNUSED_PARAMETER(iloFreq); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return 0;
#endif
}

#if  defined (CY_IP_MXS40SSRSS)
void Cy_SysClk_IloSetTrim(uint32_t trimVal)
{
#if defined (CY_IP_MXS40SSRSS)
    CY_REG32_CLR_SET(SRSS_CLK_TRIM_ILO_CTL, SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM, trimVal);
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */
#else
    CY_UNUSED_PARAMETER(trimVal); /* Suppress a compiler warning about unused variables */
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */
#endif
}

uint32_t Cy_SysClk_IloGetTrim(void)
{
#if defined (CY_IP_MXS40SSRSS)
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return (_FLD2VAL(SRSS_CLK_TRIM_ILO_CTL_ILO_FTRIM, SRSS_CLK_TRIM_ILO_CTL));
#else
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return 0;
#endif
}
#endif /* defined (CY_IP_MXS40SSRSS) */

/* ========================================================================== */
/* ======================    POWER MANAGEMENT SECTION    ==================== */
/* ========================================================================== */


/** \cond INTERNAL */
/* Timeout count for use in function Cy_SysClk_DeepSleepCallback() is sufficiently large for ~1 second */
#define TIMEOUT (1000000UL)
/** \endcond */

cy_en_syspm_status_t Cy_SysClk_DeepSleepCallback(cy_stc_syspm_callback_params_t * callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;

    /* Suppress "not used" warning */
    CY_UNUSED_PARAMETER(callbackParams);
    CY_UNUSED_PARAMETER(clkCounting);

    switch (mode)
    {
        case CY_SYSPM_CHECK_READY:
            /* Don't allow entry into Deep Sleep mode if currently measuring a frequency */
            if (!clkCounting)
            {
                /* Indicating that we can go into Deep Sleep.
                 * Prevent starting a new clock measurement until
                 * after we've come back from Deep Sleep.
                 */
                preventCounting = true;
                retVal = CY_SYSPM_SUCCESS;
            }
            break;

        case CY_SYSPM_CHECK_FAIL:
            /* Cancellation of going into Deep Sleep, therefore allow a new clock measurement */
            preventCounting = false;
            retVal = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_BEFORE_TRANSITION:
            retVal = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_AFTER_TRANSITION:
            preventCounting = false; /* Allow clock measurement */
            break;

        default: /* Unsupported mode, return CY_SYSPM_FAIL */
            break;
    }

    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return (retVal);

