RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sysclk_v2.c
}


/* ========================================================================== */
/* =====================    clk_peripherals SECTION    ====================== */
/* ========================================================================== */


uint32_t Cy_SysClk_PeriphGetFrequency(cy_en_divider_types_t dividerType, uint32_t dividerNum)
{
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to en_clk_dst_t enum.');
    return Cy_SysClk_PeriPclkGetFrequency((en_clk_dst_t)PERI_PCLK_PERIPHERAL_GROUP_NUM, dividerType, dividerNum);
}

/** \cond INTERNAL */
/* Value to indicate invalid HF NUM */
#define CY_SYSCLK_INVALID_HF_NUM (0xFFFFFFFFUL)
/** \endcond */

uint32_t Cy_Sysclk_PeriPclkGetClkHfNum(uint32_t grpNum)
{
    uint32_t instNum = (uint8_t)(((uint32_t)grpNum & PERI_GR_INST_NUM_Msk )>>PERI_GR_INST_NUM_Pos);

    CY_ASSERT_L1(grpNum < PERI_PCLK_GR_NUM(instNum));

    /* Additional check incase Asserts are disabled */
    if(grpNum >= PERI_PCLK_GR_NUM(instNum))
    {
        return CY_SYSCLK_INVALID_HF_NUM;
    }

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
        uint32_t peri0GrpToHfArray[] = { PERI0_PCLK_GR_NUM_0_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_1_CLK_HF_NUM,
                                  };

#elif defined (CY_IP_MXS22SRSS)
        uint32_t peri0GrpToHfArray[] = { PERI0_PCLK_GR_NUM_0_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_1_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_2_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_3_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_4_CLK_HF_NUM,
                                  };
#else
        uint32_t peri0GrpToHfArray[] = { PERI0_PCLK_GR_NUM_0_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_1_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_2_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_3_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_4_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_5_CLK_HF_NUM,
                                    PERI0_PCLK_GR_NUM_6_CLK_HF_NUM
                                  };
#endif

#if defined (CY_IP_MXS22SRSS)
    uint32_t peri1GrpToHfArray[] = { PERI1_PCLK_GR_NUM_0_CLK_HF_NUM,
                                PERI1_PCLK_GR_NUM_1_CLK_HF_NUM,
                                PERI1_PCLK_GR_NUM_2_CLK_HF_NUM,
                                PERI1_PCLK_GR_NUM_3_CLK_HF_NUM,
                                PERI1_PCLK_GR_NUM_4_CLK_HF_NUM,
                              };

#else
    uint32_t peri1GrpToHfArray[] = {0};
#endif

    if(0UL == instNum)
    {
        return peri0GrpToHfArray[grpNum];
    }
    else
    {
        return peri1GrpToHfArray[grpNum];
    }
}

uint32_t Cy_SysClk_PeriPclkGetFrequency(en_clk_dst_t ipBlock, cy_en_divider_types_t dividerType, uint32_t dividerNum)
{
    uint32_t integer = 0UL;        /* Integer part of peripheral divider */
    uint32_t freq = 0UL;
    uint32_t grpNum = (((uint32_t)ipBlock) & PERI_PCLK_GR_NUM_Msk )>>PERI_PCLK_GR_NUM_Pos;
    uint32_t instNum = (uint8_t)(((uint32_t)ipBlock & PERI_PCLK_INST_NUM_Msk )>>PERI_PCLK_INST_NUM_Pos);
    uint32_t hfNum = Cy_Sysclk_PeriPclkGetClkHfNum(grpNum | (instNum << PERI_GR_INST_NUM_Pos));


    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(grpNum < PERI_PCLK_GR_NUM(instNum));

    CY_ASSERT_L1(((dividerType == CY_SYSCLK_DIV_8_BIT)    && (dividerNum < PERI_DIV_8_NR(instNum , grpNum)))    || \
                 ((dividerType == CY_SYSCLK_DIV_16_BIT)   && (dividerNum < PERI_DIV_16_NR(instNum , grpNum)))   || \
                 ((dividerType == CY_SYSCLK_DIV_16_5_BIT) && (dividerNum < PERI_DIV_16_5_NR(instNum , grpNum))) || \
                 ((dividerType == CY_SYSCLK_DIV_24_5_BIT) && (dividerNum < PERI_DIV_24_5_NR(instNum , grpNum))));

    if(hfNum != CY_SYSCLK_INVALID_HF_NUM)
    {
        freq = Cy_SysClk_ClkHfGetFrequency(hfNum); /* Get CLK_HF* frequency */

        /* get the divider value for clk_peri to the selected peripheral clock */
        switch(dividerType)
        {
            case CY_SYSCLK_DIV_8_BIT:
            case CY_SYSCLK_DIV_16_BIT:
                integer = 1UL + Cy_SysClk_PeriPclkGetDivider(ipBlock, dividerType, dividerNum);
                freq = CY_SYSLIB_DIV_ROUND(freq, integer);
                break;

            case CY_SYSCLK_DIV_16_5_BIT:
            case CY_SYSCLK_DIV_24_5_BIT:
                {
                    uint32_t locFrac;
                    uint32_t locDiv;
                    uint64_t locFreq = freq * 32ULL;
                    Cy_SysClk_PeriPclkGetFracDivider(ipBlock, dividerType, dividerNum, &integer, &locFrac);
                    /* For fractional dividers, the divider is (int + 1) + frac/32 */
                    locDiv = ((1UL + integer) * 32UL) + locFrac;
                    freq = (uint32_t) CY_SYSLIB_DIV_ROUND(locFreq, (uint64_t)locDiv);
                }
                break;

            default:
                /* Unknown Divider */
                break;
        }
    }
    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return (freq);
}

#endif /* defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) || defined (CY_IP_MXS22SRSS) */
/* [] END OF FILE */
